{
    "paragraphs": [
      {
        "german": "Hallo, ich heiße Anna. Ich lerne Deutsch, weil ich in Deutschland leben möchte.",
        "english": "Hello, my name is Anna. I am learning German because I want to live in Germany."
      },
      {
        "german": "Ich wohne in Berlin. Meine Wohnung ist klein, aber gemütlich.",
        "english": "I live in Berlin. My apartment is small but cozy."
      },
      {
        "german": "Ich habe eine große Familie. Wir treffen uns oft zum Essen.",
        "english": "I have a big family. We often meet for meals."
      },
      {
        "german": "Ich arbeite in einem Büro. Mein Job ist interessant und abwechslungsreich.",
        "english": "I work in an office. My job is interesting and varied."
      },
      {
        "german": "Das Wetter ist heute schön. Die Sonne scheint und es ist warm.",
        "english": "The weather is nice today. The sun is shining and it is warm."
      },
      {
        "german": "Ich trinke jeden Morgen Kaffee. Er hilft mir, wach zu werden.",
        "english": "I drink coffee every morning. It helps me wake up."
      },
      {
        "german": "Ich lese ein spannendes Buch. Die Geschichte ist sehr interessant.",
        "english": "I am reading an exciting book. The story is very interesting."
      },
      {
        "german": "Ich gehe jeden Abend spazieren. Die frische Luft tut mir gut.",
        "english": "I go for a walk every evening. The fresh air is good for me."
      },
      {
        "german": "Ich höre gerne Musik. Klassische Musik entspannt mich.",
        "english": "I enjoy listening to music. Classical music relaxes me."
      },
      {
        "german": "Ich besuche einen Sprachkurs. Es macht mir Spaß, neue Wörter zu lernen.",
        "english": "I attend a language course. I enjoy learning new words."
      },
      {
        "german": "Ich koche gern zu Hause. Meine Familie isst oft mit mir zusammen.",
        "english": "I like cooking at home. My family often eats together with me."
      },
      {
        "german": "Am Wochenende gehe ich ins Kino. Ich sehe gerne interessante Filme.",
        "english": "On the weekend, I go to the cinema. I enjoy watching interesting movies."
      },
      {
        "german": "Ich fahre mit dem Fahrrad zur Arbeit. Es ist umweltfreundlich und gesund.",
        "english": "I ride my bicycle to work. It is environmentally friendly and healthy."
      },
      {
        "german": "Ich mache jeden Morgen Yoga. Es hilft mir, mich zu entspannen.",
        "english": "I do yoga every morning. It helps me to relax."
      },
      {
        "german": "Ich besuche oft meine Freunde. Wir unterhalten uns und lachen viel.",
        "english": "I often visit my friends. We chat and laugh a lot."
      },
      {
        "german": "Ich mag Tiere sehr. Mein Hund ist mein bester Freund.",
        "english": "I love animals very much. My dog is my best friend."
      },
      {
        "german": "Ich kaufe frisches Obst und Gemüse. Die Märkte in meiner Stadt sind toll.",
        "english": "I buy fresh fruits and vegetables. The markets in my city are great."
      },
      {
        "german": "Ich spiele gern Fußball. Es macht mir Spaß, mit meinen Freunden zu spielen.",
        "english": "I like playing soccer. It is fun to play with my friends."
      },
      {
        "german": "Ich lerne Deutsch jeden Tag. Übung macht den Meister.",
        "english": "I study German every day. Practice makes perfect."
      },
      {
        "german": "Ich besuche eine Bibliothek. Ich leihe viele interessante Bücher aus.",
        "english": "I visit a library. I borrow many interesting books."
      },
      {
        "german": "Ich liebe die Natur. Im Park fühle ich mich frei und glücklich.",
        "english": "I love nature. In the park, I feel free and happy."
      },
      {
        "german": "Ich mache einen Spaziergang im Wald. Die frische Luft ist wunderbar.",
        "english": "I take a walk in the forest. The fresh air is wonderful."
      },
      {
        "german": "Ich trinke gern Tee. Er beruhigt mich und wärmt mich.",
        "english": "I like drinking tea. It calms and warms me."
      },
      {
        "german": "Ich backe am Wochenende Kuchen. Meine Freunde lieben meine Rezepte.",
        "english": "I bake cakes on the weekend. My friends love my recipes."
      },
      {
        "german": "Ich besuche ein Museum. Die Kunstwerke sind beeindruckend und inspirierend.",
        "english": "I visit a museum. The artworks are impressive and inspiring."
      },
      {
        "german": "Ich treffe mich mit Kollegen. Wir besprechen unsere Projekte im Café.",
        "english": "I meet with colleagues. We discuss our projects at the café."
      },
      {
        "german": "Ich mache jeden Abend einen kurzen Spaziergang. Es hilft mir, den Tag abzuschließen.",
        "english": "I take a short walk every evening. It helps me to finish the day."
      },
      {
        "german": "Ich genieße es, Musik zu spielen. Mein Klavier bringt mir viel Freude.",
        "english": "I enjoy playing music. My piano brings me a lot of joy."
      },
      {
        "german": "Ich besuche einen Wochenmarkt. Dort kaufe ich frische Produkte und treffe Freunde.",
        "english": "I visit a weekly market. There I buy fresh products and meet friends."
      },
      {
        "german": "Ich lerne jeden Tag neue Wörter. Das hilft mir, meinen Wortschatz zu erweitern.",
        "english": "I learn new words every day. This helps me expand my vocabulary."
      },
      {
        "german": "Ich fahre gern in den Urlaub. Ich liebe es, neue Orte zu entdecken.",
        "english": "I enjoy going on vacation. I love discovering new places."
      },
      {
        "german": "Ich besuche oft meine Großeltern. Sie erzählen mir spannende Geschichten.",
        "english": "I often visit my grandparents. They tell me fascinating stories."
      },
      {
        "german": "Ich esse gern Pizza. Es ist mein Lieblingsessen an Wochenenden.",
        "english": "I like eating pizza. It is my favorite food on weekends."
      },
      {
        "german": "Ich trinke gern Wasser. Es ist gesund und erfrischend.",
        "english": "I like drinking water. It is healthy and refreshing."
      },
      {
        "german": "Ich mag es, im Garten zu arbeiten. Die Blumen blühen in vielen Farben.",
        "english": "I enjoy working in the garden. The flowers bloom in many colors."
      },
      {
        "german": "Ich gehe regelmäßig joggen. Es hält mich fit und energiegeladen.",
        "english": "I go jogging regularly. It keeps me fit and energetic."
      },
      {
        "german": "Ich höre oft Podcasts. Sie informieren mich über aktuelle Themen.",
        "english": "I often listen to podcasts. They inform me about current topics."
      },
      {
        "german": "Ich besuche ein Café in der Stadt. Dort treffe ich nette Menschen.",
        "english": "I visit a café in the city. I meet nice people there."
      },
      {
        "german": "Ich male gern Bilder. Die Farben machen mich glücklich.",
        "english": "I like painting pictures. The colors make me happy."
      },
      {
        "german": "Ich lerne jeden Tag etwas Neues. Das macht das Leben interessant.",
        "english": "I learn something new every day. That makes life interesting."
      },
      {
        "german": "Ich fahre mit dem Bus zur Arbeit. Es ist eine bequeme Art zu reisen.",
        "english": "I take the bus to work. It is a comfortable way to travel."
      },
      {
        "german": "Ich gehe am Sonntag oft in die Kirche. Es ist ein ruhiger und besinnlicher Ort.",
        "english": "I often go to church on Sundays. It is a calm and reflective place."
      },
      {
        "german": "Ich mache gern Fotos. Meine Kamera ist immer dabei.",
        "english": "I enjoy taking photos. My camera is always with me."
      },
      {
        "german": "Ich höre gerne Radio. Die Musik und Nachrichten sind interessant.",
        "english": "I like listening to the radio. The music and news are interesting."
      },
      {
        "german": "Ich besuche einen Tanzkurs. Es macht mir Spaß, neue Tanzschritte zu lernen.",
        "english": "I attend a dance course. I enjoy learning new dance moves."
      },
      {
        "german": "Ich lese die Zeitung jeden Morgen. So bleibe ich über das Weltgeschehen informiert.",
        "english": "I read the newspaper every morning. This keeps me informed about world events."
      },
      {
        "german": "Ich spiele gerne Karten mit meinen Freunden. Es ist ein lustiges und soziales Spiel.",
        "english": "I like playing cards with my friends. It is a fun and social game."
      },
      {
        "german": "Ich besuche oft Sprachcafés. Dort kann ich Deutsch mit Muttersprachlern üben.",
        "english": "I often visit language cafés. There, I can practice German with native speakers."
      },
      {
        "german": "Ich genieße meine Freizeit im Park. Die Natur und frische Luft entspannen mich.",
        "english": "I enjoy my free time in the park. The nature and fresh air relax me."
      },
      {
        "german": "Ich treffe mich mit meiner Familie zum Abendessen. Wir reden über unseren Tag.",
        "english": "I meet my family for dinner. We talk about our day."
      },
      {
        "german": "Ich mache jeden Morgen ein leichtes Frühstück. Es gibt mir Energie für den Tag.",
        "english": "I have a light breakfast every morning. It gives me energy for the day."
      },
      {
        "german": "Ich besuche einen Fitnesskurs. Die Übungen sind einfach und effektiv.",
        "english": "I attend a fitness class. The exercises are simple and effective."
      },
      {
        "german": "Ich mag es, neue Städte zu erkunden. Jede Stadt hat ihre eigene Atmosphäre.",
        "english": "I enjoy exploring new cities. Each city has its own atmosphere."
      },
      {
        "german": "Ich fahre gerne mit dem Zug. Die Landschaften sind wunderschön.",
        "english": "I enjoy taking the train. The landscapes are beautiful."
      },
      {
        "german": "Ich lerne Deutsch, um neue Freunde zu finden. Kommunikation ist sehr wichtig.",
        "english": "I study German to make new friends. Communication is very important."
      },
      {
        "german": "Ich besuche regelmäßig Konzerte. Die Musik bringt mir viel Freude.",
        "english": "I regularly attend concerts. The music brings me a lot of joy."
      },
      {
        "german": "Ich koche gern traditionelle Gerichte. Es erinnert mich an meine Heimat.",
        "english": "I enjoy cooking traditional dishes. It reminds me of my homeland."
      },
      {
        "german": "Ich besuche einen Wochenendmarkt. Dort kaufe ich frische und gesunde Lebensmittel.",
        "english": "I visit a weekend market. There, I buy fresh and healthy groceries."
      },
      {
        "german": "Ich fahre mit dem Fahrrad im Park. Es ist eine gute Übung für den Körper.",
        "english": "I ride my bicycle in the park. It is a good exercise for the body."
      },
      {
        "german": "Ich höre oft Hörbücher. Sie sind interessant und unterhaltsam.",
        "english": "I often listen to audiobooks. They are interesting and entertaining."
      },
      {
        "german": "Ich spiele gern Brettspiele. Sie fördern mein Denken und meine Kreativität.",
        "english": "I enjoy playing board games. They stimulate my thinking and creativity."
      },
      {
        "german": "Ich lerne jeden Tag ein neues deutsches Wort. So verbessere ich meinen Wortschatz.",
        "english": "I learn a new German word every day. This way, I improve my vocabulary."
      },
      {
        "german": "Ich treffe mich am Wochenende mit Freunden. Wir verbringen gemeinsam schöne Stunden.",
        "english": "I meet my friends on the weekend. We spend pleasant hours together."
      },
      {
        "german": "Ich gehe gern in den Zoo. Die Tiere sind faszinierend und schön.",
        "english": "I enjoy going to the zoo. The animals are fascinating and beautiful."
      },
      {
        "german": "Ich esse gern frische Brötchen zum Frühstück. Sie sind lecker und knusprig.",
        "english": "I like eating fresh rolls for breakfast. They are tasty and crunchy."
      },
      {
        "german": "Ich lese gern Kurzgeschichten. Jede Geschichte hat eine besondere Botschaft.",
        "english": "I enjoy reading short stories. Each story has a special message."
      },
      {
        "german": "Ich besuche oft Sprachpartner-Treffen. Es hilft mir, mein Deutsch zu verbessern.",
        "english": "I often attend language partner meetings. It helps me improve my German."
      },
      {
        "german": "Ich mag es, im Park zu entspannen. Die Sonne und die Natur machen mich glücklich.",
        "english": "I like relaxing in the park. The sun and nature make me happy."
      },
      {
        "german": "Ich treffe mich regelmäßig mit meinen Kollegen. Wir diskutieren über verschiedene Themen.",
        "english": "I regularly meet with my colleagues. We discuss various topics."
      },
      {
        "german": "Ich mache gern kleine Ausflüge am Wochenende. Es ist erfrischend, die Umgebung zu erkunden.",
        "english": "I enjoy short trips on the weekend. It is refreshing to explore the surroundings."
      },
      {
        "german": "Ich liebe es, in der Stadt zu spazieren. Die Straßen sind lebendig und bunt.",
        "english": "I love walking in the city. The streets are lively and colorful."
      },
      {
        "german": "Ich besuche einen Bauernmarkt. Dort finde ich regionale und frische Produkte.",
        "english": "I visit a farmers' market. There I find local and fresh products."
      },
      {
        "german": "Ich spiele gern Videospiele. Sie machen Spaß und fördern meine Reaktionsfähigkeit.",
        "english": "I enjoy playing video games. They are fun and improve my reaction skills."
      },
      {
        "german": "Ich lerne Deutsch, um mehr über die Kultur zu erfahren. Kultur ist sehr interessant für mich.",
        "english": "I study German to learn more about the culture. Culture is very interesting to me."
      },
      {
        "german": "Ich gehe oft ins Restaurant. Dort probiere ich verschiedene leckere Gerichte.",
        "english": "I often go to restaurants. There, I try various delicious dishes."
      },
      {
        "german": "Ich genieße es, am Strand spazieren zu gehen. Das Meeresrauschen entspannt mich.",
        "english": "I enjoy walking on the beach. The sound of the ocean relaxes me."
      },
      {
        "german": "Ich besuche oft lokale Feste. Die Musik und Tänze sind sehr unterhaltsam.",
        "english": "I often attend local festivals. The music and dances are very entertaining."
      },
      {
        "german": "Ich mache jeden Morgen eine kurze Meditation. Sie hilft mir, den Tag positiv zu beginnen.",
        "english": "I do a short meditation every morning. It helps me start the day positively."
      },
      {
        "german": "Ich treffe mich mit meinem Bruder. Wir reden über unsere Erlebnisse und Pläne.",
        "english": "I meet with my brother. We talk about our experiences and plans."
      },
      {
        "german": "Ich besuche einen Kunstkurs. Das Malen ist kreativ und entspannend.",
        "english": "I attend an art course. Painting is creative and relaxing."
      },
      {
        "german": "Ich lerne jeden Tag etwas über die deutsche Kultur. Das macht mich neugierig.",
        "english": "I learn something about German culture every day. It makes me curious."
      },
      {
        "german": "Ich mache gern Spaziergänge im Regen. Der Regen erfrischt die Natur.",
        "english": "I enjoy walking in the rain. The rain refreshes nature."
      },
      {
        "german": "Ich besuche einen Kochkurs. Dort lerne ich, neue Rezepte zu kochen.",
        "english": "I attend a cooking course. There, I learn how to cook new recipes."
      },
      {
        "german": "Ich genieße es, am Abend Tee zu trinken. Es entspannt mich und gibt mir Ruhe.",
        "english": "I enjoy drinking tea in the evening. It relaxes me and gives me peace."
      },
      {
        "german": "Ich fahre gern in den Bergen. Die Aussicht ist atemberaubend und friedlich.",
        "english": "I enjoy going to the mountains. The view is breathtaking and peaceful."
      },
      {
        "german": "Ich mache einen Spaziergang im Park. Die frischen Blumen erfreuen mich.",
        "english": "I take a walk in the park. The fresh flowers delight me."
      },
      {
        "german": "Ich besuche oft den Wochenmarkt. Dort treffe ich nette Verkäufer.",
        "english": "I often visit the weekly market. There, I meet friendly vendors."
      },
      {
        "german": "Ich koche gerne Pasta. Es ist einfach und sehr schmackhaft.",
        "english": "I like cooking pasta. It is simple and very tasty."
      },
      {
        "german": "Ich lerne Deutsch, um in Deutschland zu studieren. Bildung ist mir sehr wichtig.",
        "english": "I study German to study in Germany. Education is very important to me."
      },
      {
        "german": "Ich treffe mich am Samstag mit Freunden. Wir spielen Brettspiele und lachen viel.",
        "english": "I meet with friends on Saturday. We play board games and laugh a lot."
      },
      {
        "german": "Ich genieße lange Spaziergänge am Abend. Die frische Luft ist wunderbar.",
        "english": "I enjoy long walks in the evening. The fresh air is wonderful."
      },
      {
        "german": "Ich besuche oft kulturelle Veranstaltungen. Sie erweitern meinen Horizont.",
        "english": "I often attend cultural events. They broaden my horizons."
      },
      {
        "german": "Ich trinke gern einen heißen Kakao. Er schmeckt besonders im Winter gut.",
        "english": "I like drinking hot cocoa. It tastes especially good in winter."
      },
      {
        "german": "Ich mache jeden Morgen Dehnübungen. Sie bereiten meinen Körper auf den Tag vor.",
        "english": "I do stretching exercises every morning. They prepare my body for the day."
      },
      {
        "german": "Ich lerne neue deutsche Sätze. Jeder Satz hilft mir, besser zu sprechen.",
        "english": "I learn new German sentences. Every sentence helps me speak better."
      },
      {
        "german": "Ich treffe mich oft im Park. Dort genieße ich die Natur und die Ruhe.",
        "english": "I often meet in the park. There, I enjoy nature and peace."
      },
      {
        "german": "Ich besuche eine Sprachschule. Dort lerne ich viele nützliche Ausdrücke.",
        "english": "I attend a language school. There, I learn many useful expressions."
      },
      {
        "german": "Ich mache gern Ausflüge ins Umland. Die Landschaft ist immer beeindruckend.",
        "english": "I enjoy excursions to the countryside. The scenery is always impressive."
      },
      {
        "german": "Ich liebe es, im Sommer draußen zu sein. Die Sonne und das warme Wetter sind toll.",
        "english": "I love being outside in the summer. The sun and warm weather are great."
      },
      {
        "german": "Ich verbringe gerne Zeit mit meinen Freunden. Wir unternehmen viele interessante Aktivitäten.",
        "english": "I like spending time with my friends. We do many interesting activities together."
      },
      {
        "german": "Ich besuche regelmäßig den Park. Die Natur und die Bäume beruhigen mich.",
        "english": "I regularly visit the park. The nature and the trees calm me down."
      },
      {
        "german": "Ich genieße es, am Wochenende zu entspannen. Ein gutes Buch und Musik machen mich glücklich.",
        "english": "I enjoy relaxing on the weekend. A good book and music make me happy."
      },
      {
        "german": "Ich mache oft eine Pause, um frische Luft zu schnappen. Es hilft mir, mich zu konzentrieren.",
        "english": "I often take a break to get some fresh air. It helps me concentrate."
      },
      {
        "german": "Ich besuche einen kleinen Markt in meiner Nachbarschaft. Dort kaufe ich regionale Produkte.",
        "english": "I visit a small market in my neighborhood. There, I buy local products."
      },
      {
        "german": "Ich trinke gern frisch gepressten Orangensaft. Er ist gesund und lecker.",
        "english": "I enjoy drinking freshly squeezed orange juice. It is healthy and delicious."
      },
      {
        "german": "Ich lese jeden Abend vor dem Schlafengehen. Es hilft mir, mich zu entspannen.",
        "english": "I read every evening before bed. It helps me relax."
      },
      {
        "german": "Ich höre gern entspannte Musik. Sie begleitet mich während meiner Arbeit.",
        "english": "I enjoy listening to relaxing music. It accompanies me during my work."
      },
      {
        "german": "Ich besuche oft einen Garten. Die Pflanzen und Blumen inspirieren mich.",
        "english": "I often visit a garden. The plants and flowers inspire me."
      },
      {
        "german": "Ich koche gerne einfache Gerichte. Die Rezepte sind leicht zu verstehen.",
        "english": "I like cooking simple dishes. The recipes are easy to understand."
      },
      {
        "german": "Ich lerne jeden Tag ein bisschen mehr Deutsch. Es verbessert sich stetig mein Sprachniveau.",
        "english": "I learn a little more German every day. My language skills steadily improve."
      },
      {
        "german": "Ich besuche oft das Stadtzentrum. Die Geschäfte und Cafés sind interessant.",
        "english": "I often visit the city center. The shops and cafés are interesting."
      },
      {
        "german": "Ich genieße ruhige Momente zu Hause. Ein warmes Licht und leise Musik machen den Abend perfekt.",
        "english": "I enjoy quiet moments at home. Warm light and soft music make the evening perfect."
      },
      {
        "german": "Ich fahre gern mit dem Auto in die Natur. Die Straße und Landschaft sind entspannend.",
        "english": "I like driving into nature by car. The road and scenery are relaxing."
      },
      {
        "german": "Ich besuche ein kleines Café in meiner Stadt. Dort treffe ich oft nette Leute.",
        "english": "I visit a small café in my city. There, I often meet friendly people."
      },
      {
        "german": "Ich mache jeden Tag kleine Notizen. Sie helfen mir, wichtige Gedanken festzuhalten.",
        "english": "I take small notes every day. They help me remember important thoughts."
      },
      {
        "german": "Ich treffe mich mit Freunden in der Stadt. Wir unterhalten uns über unser Leben.",
        "english": "I meet with friends in the city. We talk about our lives."
      },
      {
        "german": "Ich gehe regelmäßig in den Park, um zu entspannen. Die Natur gibt mir neue Energie.",
        "english": "I regularly go to the park to relax. Nature gives me new energy."
      },
      {
        "german": "Ich besuche eine Kunstausstellung. Die Bilder und Skulpturen sind sehr beeindruckend.",
        "english": "I visit an art exhibition. The paintings and sculptures are very impressive."
      },
      {
        "german": "Ich trinke gern kalten Eistee. Er ist erfrischend an heißen Tagen.",
        "english": "I enjoy drinking cold iced tea. It is refreshing on hot days."
      },
      {
        "german": "Ich mache jeden Morgen einen kurzen Spaziergang. Die frische Luft weckt mich auf.",
        "english": "I take a short walk every morning. The fresh air wakes me up."
      },
      {
        "german": "Ich besuche oft den See in der Nähe. Das Wasser ist ruhig und klar.",
        "english": "I often visit the nearby lake. The water is calm and clear."
      },
      {
        "german": "Ich genieße es, in der Natur zu sein. Die Bäume und Vögel sind schön anzusehen.",
        "english": "I enjoy being in nature. The trees and birds are lovely to watch."
      },
      {
        "german": "Ich lerne Deutsch mit Freude. Jeder Tag bringt mir neue Erkenntnisse.",
        "english": "I learn German with joy. Every day brings me new insights."
      },
      {
        "german": "Ich treffe oft Menschen in meiner Stadt. Jeder hat eine interessante Geschichte zu erzählen.",
        "english": "I often meet people in my city. Everyone has an interesting story to tell."
      },
      {
        "german": "Ich mache am Wochenende Ausflüge. Neue Orte zu entdecken, ist immer spannend.",
        "english": "I go on trips on the weekend. Discovering new places is always exciting."
      },
      {
        "german": "Ich besuche gerne Flohmärkte. Dort finde ich oft einzigartige Gegenstände.",
        "english": "I enjoy visiting flea markets. I often find unique items there."
      },
      {
        "german": "Ich koche gerne Reisgerichte. Sie sind einfach und sättigend.",
        "english": "I enjoy cooking rice dishes. They are simple and filling."
      },
      {
        "german": "Ich lerne Deutsch, um meine Karrierechancen zu verbessern. Es eröffnet mir viele Möglichkeiten.",
        "english": "I study German to improve my career opportunities. It opens many possibilities for me."
      },
      {
        "german": "Ich besuche oft meinen Lieblingspark. Dort fühle ich mich frei und entspannt.",
        "english": "I often visit my favorite park. There, I feel free and relaxed."
      },
      {
        "german": "Ich genieße lange Sommerabende. Das warme Licht und die Ruhe sind wunderbar.",
        "english": "I enjoy long summer evenings. The warm light and calmness are wonderful."
      },
      {
        "german": "Ich mache gern Sport im Freien. Bewegung tut meinem Körper gut.",
        "english": "I enjoy outdoor sports. Exercise is good for my body."
      },
      {
        "german": "Ich besuche einen Friseursalon. Ein frischer Haarschnitt macht mich glücklich.",
        "english": "I visit a hair salon. A fresh haircut makes me happy."
      },
      {
        "german": "Ich trinke gern frisch gebrühten Kaffee. Er duftet so verlockend.",
        "english": "I enjoy freshly brewed coffee. It smells so enticing."
      },
      {
        "german": "Ich lerne jeden Tag neue Sätze. So verbessere ich mein Deutsch kontinuierlich.",
        "english": "I learn new sentences every day. This way, I continuously improve my German."
      },
      {
        "german": "Ich treffe oft alte Freunde. Wir erinnern uns an unsere gemeinsame Vergangenheit.",
        "english": "I often meet old friends. We reminisce about our past together."
      },
      {
        "german": "Ich besuche regelmäßig Kunstausstellungen. Kunst inspiriert mich sehr.",
        "english": "I regularly visit art exhibitions. Art inspires me a lot."
      },
      {
        "german": "Ich mache jeden Morgen ein gesundes Frühstück. Es gibt mir Kraft für den Tag.",
        "english": "I have a healthy breakfast every morning. It gives me strength for the day."
      },
      {
        "german": "Ich höre gern die Nachrichten. Sie halten mich über aktuelle Ereignisse auf dem Laufenden.",
        "english": "I enjoy listening to the news. They keep me informed about current events."
      },
      {
        "german": "Ich besuche einen Buchladen. Dort finde ich viele spannende Geschichten.",
        "english": "I visit a bookstore. There I find many exciting stories."
      },
      {
        "german": "Ich lerne Deutsch, um in Europa zu reisen. Es macht das Reisen einfacher.",
        "english": "I study German to travel in Europe. It makes traveling easier."
      },
      {
        "german": "Ich mache oft einen Spaziergang in der Abenddämmerung. Die Farben des Himmels sind wunderschön.",
        "english": "I often take a walk at dusk. The colors of the sky are beautiful."
      },
      {
        "german": "Ich besuche einen botanischen Garten. Die Vielfalt der Pflanzen fasziniert mich.",
        "english": "I visit a botanical garden. The variety of plants fascinates me."
      },
      {
        "german": "Ich trinke gern grünen Tee. Er ist gesund und wohltuend.",
        "english": "I enjoy drinking green tea. It is healthy and soothing."
      },
      {
        "german": "Ich mache jeden Tag ein kleines Tagebuch. Es hilft mir, meine Gedanken zu ordnen.",
        "english": "I write a small journal every day. It helps me organize my thoughts."
      },
      {
        "german": "Ich besuche oft einen Yoga-Kurs. Die Übungen machen meinen Körper flexibel.",
        "english": "I often attend a yoga class. The exercises make my body flexible."
      },
      {
        "german": "Ich lerne Deutsch, um neue Kulturen zu verstehen. Es erweitert meinen Horizont.",
        "english": "I study German to understand new cultures. It broadens my horizons."
      },
      {
        "german": "Ich genieße Spaziergänge in historischen Stadtteilen. Die Architektur ist beeindruckend.",
        "english": "I enjoy walks in historic neighborhoods. The architecture is impressive."
      },
      {
        "german": "Ich koche gern verschiedene internationale Gerichte. Es macht Spaß, neue Rezepte auszuprobieren.",
        "english": "I enjoy cooking various international dishes. It is fun to try new recipes."
      },
      {
        "german": "Ich besuche einen Tanzabend. Die Musik und Bewegung bringen Freude.",
        "english": "I attend a dance evening. The music and movement bring joy."
      },
      {
        "german": "Ich trinke gern ein Glas kaltes Wasser. Es erfrischt mich an heißen Tagen.",
        "english": "I enjoy a glass of cold water. It refreshes me on hot days."
      },
      {
        "german": "Ich mache jeden Morgen einen kurzen Lauf. Es gibt mir Energie für den Tag.",
        "english": "I go for a short run every morning. It gives me energy for the day."
      },
      {
        "german": "Ich besuche oft meinen Lieblingsladen. Dort finde ich schöne und praktische Dinge.",
        "english": "I often visit my favorite store. There, I find nice and practical things."
      },
      {
        "german": "Ich lerne Deutsch, um im Ausland zu studieren. Es ist eine spannende Herausforderung.",
        "english": "I study German to study abroad. It is an exciting challenge."
      },
      {
        "german": "Ich genieße es, an lauen Abenden spazieren zu gehen. Die kühle Brise ist angenehm.",
        "english": "I enjoy walking on mild evenings. The cool breeze is pleasant."
      },
      {
        "german": "Ich besuche einen lokalen Markt. Die frischen Produkte sind von bester Qualität.",
        "english": "I visit a local market. The fresh products are of the best quality."
      },
      {
        "german": "Ich trinke gern Früchtetee. Er ist aromatisch und gesund.",
        "english": "I enjoy drinking fruit tea. It is aromatic and healthy."
      },
      {
        "german": "Ich mache jeden Tag ein kurzes Nickerchen. Es hilft mir, mich zu erholen.",
        "english": "I take a short nap every day. It helps me to recover."
      },
      {
        "german": "Ich besuche oft meinen Lieblingspark im Sommer. Die Bäume spenden angenehmen Schatten.",
        "english": "I often visit my favorite park in summer. The trees provide pleasant shade."
      },
      {
        "german": "Ich lerne Deutsch, um mich mit Einheimischen zu unterhalten. Es macht die Kommunikation leichter.",
        "english": "I study German to converse with locals. It makes communication easier."
      },
      {
        "german": "Ich genieße es, im Freien zu lesen. Die frische Luft und Natur inspirieren mich.",
        "english": "I enjoy reading outdoors. The fresh air and nature inspire me."
      },
      {
        "german": "Ich mache regelmäßig Sport, um fit zu bleiben. Bewegung ist wichtig für die Gesundheit.",
        "english": "I exercise regularly to stay fit. Exercise is important for health."
      },
      {
        "german": "Ich besuche oft kulturelle Festivals. Die Musik und Kunst sind sehr faszinierend.",
        "english": "I often attend cultural festivals. The music and art are very fascinating."
      },
      {
        "german": "Ich trinke gern heiße Schokolade. Sie schmeckt besonders an kalten Tagen gut.",
        "english": "I enjoy hot chocolate. It tastes especially good on cold days."
      },
      {
        "german": "Ich mache jeden Morgen eine kurze Meditation. Es beruhigt meinen Geist und Körper.",
        "english": "I do a short meditation every morning. It calms my mind and body."
      },
      {
        "german": "Ich besuche oft eine Bibliothek, um zu lernen. Die Bücher sind sehr hilfreich.",
        "english": "I often visit a library to study. The books are very helpful."
      },
      {
        "german": "Ich lerne Deutsch, um mich beruflich weiterzuentwickeln. Es eröffnet neue Chancen.",
        "english": "I study German to advance my career. It opens up new opportunities."
      },
      {
        "german": "Ich genieße es, im Garten zu arbeiten. Die frische Erde und Pflanzen machen mich glücklich.",
        "english": "I enjoy working in the garden. The fresh soil and plants make me happy."
      },
      {
        "german": "Ich mache jeden Tag einen kurzen Spaziergang. Es hilft mir, den Kopf frei zu bekommen.",
        "english": "I take a short walk every day. It helps clear my mind."
      },
      {
        "german": "Ich besuche oft einen ruhigen See. Die Stille und Natur beruhigen mich.",
        "english": "I often visit a quiet lake. The silence and nature calm me."
      },
      {
        "german": "Ich lerne Deutsch, um mich besser auszudrücken. Jede Lektion bringt mich voran.",
        "english": "I study German to express myself better. Every lesson moves me forward."
      },
      {
        "german": "Ich genieße es, frische Luft zu atmen. Die Natur ist mein Rückzugsort.",
        "english": "I enjoy breathing fresh air. Nature is my refuge."
      },
      {
        "german": "Ich mache jeden Morgen ein leichtes Frühstück. Es ist der perfekte Start in den Tag.",
        "english": "I have a light breakfast every morning. It is the perfect start to the day."
      },
      {
        "german": "Ich besuche oft ein kleines Café in meiner Nachbarschaft. Dort fühle ich mich wie zu Hause.",
        "english": "I often visit a small café in my neighborhood. I feel at home there."
      },
      {
        "german": "Ich lerne Deutsch, um mit Menschen aus verschiedenen Ländern zu sprechen. Es ist eine wertvolle Fähigkeit.",
        "english": "I study German to speak with people from different countries. It is a valuable skill."
      },
      {
        "german": "Ich genieße es, neue Rezepte auszuprobieren. Das Kochen ist für mich eine kreative Tätigkeit.",
        "english": "I enjoy trying new recipes. Cooking is a creative activity for me."
      },
      {
        "german": "Ich mache jeden Tag kleine Notizen in meinem Tagebuch. Sie helfen mir, den Tag zu reflektieren.",
        "english": "I write small notes in my journal every day. They help me reflect on the day."
      },
      {
        "german": "Ich besuche oft einen Markt, um frisches Obst zu kaufen. Die Auswahl ist immer groß.",
        "english": "I often visit a market to buy fresh fruit. The selection is always large."
      },
      {
        "german": "Ich lerne Deutsch, weil ich die Sprache liebe. Es ist eine schöne und interessante Sprache.",
        "english": "I study German because I love the language. It is a beautiful and interesting language."
      },
      {
        "german": "Ich genieße es, in einem ruhigen Café zu sitzen. Dort kann ich nachdenken und entspannen.",
        "english": "I enjoy sitting in a quiet café. There, I can think and relax."
      },
      {
        "german": "Ich mache jeden Abend einen Spaziergang, um den Tag abzuschließen. Es hilft mir, zur Ruhe zu kommen.",
        "english": "I take a walk every evening to end the day. It helps me calm down."
      },
      {
        "german": "Ich besuche oft ein kleines Theater in der Stadt. Die Aufführungen sind kreativ und unterhaltsam.",
        "english": "I often visit a small theater in the city. The performances are creative and entertaining."
      },
      {
        "german": "Ich lerne Deutsch, um meine Sprachkenntnisse zu verbessern. Es ist ein interessanter Lernprozess.",
        "english": "I study German to improve my language skills. It is an interesting learning process."
      },
      {
        "german": "Ich genieße es, frische Blumen im Garten zu sehen. Sie bringen Farbe in meinen Alltag.",
        "english": "I enjoy seeing fresh flowers in the garden. They bring color to my daily life."
      },
      {
        "german": "Ich mache jeden Morgen Dehnübungen, um fit zu bleiben. Es hilft mir, Verletzungen zu vermeiden.",
        "english": "I do stretching exercises every morning to stay fit. It helps me avoid injuries."
      },
      {
        "german": "Ich besuche oft einen Park, um ein Buch zu lesen. Die Umgebung ist ruhig und inspirierend.",
        "english": "I often visit a park to read a book. The environment is calm and inspiring."
      },
      {
        "german": "Ich lerne Deutsch, um mit meiner Familie besser zu kommunizieren. Es stärkt unsere Beziehungen.",
        "english": "I study German to communicate better with my family. It strengthens our relationships."
      },
      {
        "german": "Ich genieße es, an warmen Tagen draußen zu sein. Die Sonne und der Himmel sind wunderbar.",
        "english": "I enjoy being outside on warm days. The sun and sky are wonderful."
      },
      {
        "german": "Ich mache jeden Abend eine kurze Entspannungsübung. Es hilft mir, Stress abzubauen.",
        "english": "I do a short relaxation exercise every evening. It helps me relieve stress."
      },
      {
        "german": "Ich besuche oft einen kleinen Park in meiner Stadt. Dort finde ich Ruhe und Erholung.",
        "english": "I often visit a small park in my city. There I find peace and relaxation."
      },
      {
        "german": "Ich lerne Deutsch, um besser zu verstehen, was in Filmen gesagt wird. Es macht das Anschauen interessanter.",
        "english": "I study German to better understand what is said in films. It makes watching them more interesting."
      },
      {
        "german": "Ich genieße es, am Morgen die Zeitung zu lesen. Die Nachrichten informieren mich über den Tag.",
        "english": "I enjoy reading the newspaper in the morning. The news informs me about the day."
      },
      {
        "german": "Ich mache jeden Tag kleine Achtsamkeitsübungen. Sie helfen mir, im Moment zu leben.",
        "english": "I do small mindfulness exercises every day. They help me live in the moment."
      },
      {
        "german": "Ich besuche oft einen Kunstmarkt. Dort finde ich einzigartige und kreative Werke.",
        "english": "I often visit an art market. There I find unique and creative works."
      },
      {
        "german": "Ich lerne Deutsch, um in einer internationalen Firma zu arbeiten. Es ist ein wichtiger Schritt für meine Karriere.",
        "english": "I study German to work in an international company. It is an important step for my career."
      },
      {
        "german": "Ich genieße es, am Abend einen Spaziergang zu machen. Die kühle Luft beruhigt mich.",
        "english": "I enjoy taking a walk in the evening. The cool air calms me."
      },
      {
        "german": "Ich mache jeden Morgen ein paar einfache Übungen. Sie bereiten mich auf den Tag vor.",
        "english": "I do a few simple exercises every morning. They prepare me for the day."
      },
      {
        "german": "Ich besuche oft meinen Lieblingspark. Dort fühle ich mich wohl und entspannt.",
        "english": "I often visit my favorite park. I feel comfortable and relaxed there."
      },
      {
        "german": "Ich lerne Deutsch, weil ich neue Leute kennenlernen möchte. Es ist eine spannende Erfahrung.",
        "english": "I study German because I want to meet new people. It is an exciting experience."
      },
      {
        "german": "Ich genieße es, am Wochenende lange zu schlafen. Es ist erholsam und angenehm.",
        "english": "I enjoy sleeping in on weekends. It is relaxing and pleasant."
      },
      {
        "german": "Ich mache jeden Abend einen Spaziergang, um den Tag ausklingen zu lassen. Es ist mein Weg, Ruhe zu finden.",
        "english": "I take a walk every evening to wind down the day. It is my way of finding peace."
      },
      {
          "german": "Heute ist Montag. Die Woche fängt gut an.",
          "english": "Today is Monday. The week starts well."
      },
      {
          "german": "Am Samstag und Sonntag habe ich frei. Das ist mein Wochenende.",
          "english": "On Saturday and Sunday I am off. That's my weekend."
      },
      {
          "german": "Wir haben Weihnachten im Dezember gefeiert. Das Jahr ist fast zu Ende.",
          "english": "We celebrated Christmas in December. The year is almost over."
      },
      {
          "german": "Im Frühling wird es wärmer. Der Sommer kommt bald.",
          "english": "In spring it gets warmer. Summer is coming soon."
      },
      {
          "german": "Es ist jetzt Mittag. Wir essen um 12 Uhr.",
          "english": "It is noon now. We eat at 12 o'clock."
      },
      {
          "german": "Wie spät ist es? Es ist 9 Uhr.",
          "english": "What time is it? It is 9 o'clock."
      },
      {
          "german": "Mein Vorname ist Anna und mein Nachname ist Müller. Können Sie das bitte buchstabieren?",
          "english": "My first name is Anna and my last name is Müller. Can you please spell that?"
      },
      {
          "german": "Ich bin Frau Schmidt und wohne in der Schillerstraße 5. Meine Hausnummer ist fünf.",
          "english": "I am Mrs. Schmidt and I live in Schiller Street number 5. My house number is five."
      },
      {
          "german": "Ich lebe in Berlin, das ist eine große Stadt in Deutschland. Meine Postleitzahl ist 10115.",
          "english": "I live in Berlin, which is a big city in Germany. My postal code is 10115."
      },
      {
          "german": "Mein Telefon ist 0176-1234567. Sie können mich anrufen.",
          "english": "My phone number is 0176-1234567. You can call me."
      },
      {
          "german": "Mein Geburtstag ist am 15. Juli. Ich bin ledig.",
          "english": "My birthday is on July 15th. I am single."
      },
      {
          "german": "Ich habe eine kleine Familie. Meine Mutter und mein Vater leben in einem Dorf.",
          "english": "I have a small family. My mother and my father live in a village."
      },
      {
          "german": "Ich habe einen Bruder und eine Schwester. Meine Geschwister sind älter als ich.",
          "english": "I have a brother and a sister. My siblings are older than me."
      },
      {
          "german": "Meine Großmutter, oder Oma, ist sehr lieb. Mein Großvater, oder Opa, erzählt tolle Geschichten.",
          "english": "My grandmother, or grandma, is very kind. My grandfather, or grandpa, tells great stories."
      },
      {
          "german": "Mein Bruder ist Arzt und arbeitet im Krankenhaus. Seine Frau ist Ärztin.",
          "english": "My brother is a doctor and works in the hospital. His wife is a doctor (female)."
      },
      {
          "german": "Meine Schwester ist Lehrerin an einer Grundschule. Ihr Mann ist Lehrer.",
          "english": "My sister is a teacher (female) at a primary school. Her husband is a teacher."
      },
      {
          "german": "Ich arbeite als Verkäufer in einem Supermarkt. Meine Kollegin ist auch Verkäuferin.",
          "english": "I work as a salesman in a supermarket. My colleague (female) is also a saleswoman."
      },
      {
          "german": "Mein Vater war früher Ingenieur. Jetzt ist er Rentner.",
          "english": "My father used to be an engineer. Now he is retired."
      },
      {
          "german": "Meine Mutter ist Hausfrau und kümmert sich um den Haushalt. Manchmal arbeitet sie als Sekretärin.",
          "english": "My mother is a housewife and takes care of the household. Sometimes she works as a secretary."
      },
      {
          "german": "Ich trage heute eine blaue Hose und ein weißes Hemd. Meine Schuhe sind schwarz.",
          "english": "Today I am wearing blue trousers and a white shirt. My shoes are black."
      },
      {
          "german": "Meine Lieblingsfarbe ist grün. Ich habe einen grünen Pullover und eine graue Jacke.",
          "english": "My favourite colour is green. I have a green sweater and a grey jacket."
      },
      {
          "german": "Im Winter brauche ich einen warmen Mantel. Meine Jeans sind bequem.",
          "english": "In winter I need a warm coat. My jeans are comfortable."
      },
      {
          "german": "Welche Größe haben Sie? Ich brauche Größe 38 für einen Rock.",
          "english": "What size do you have? I need size 38 for a skirt."
      },
      {
          "german": "In meiner Freizeit spiele ich gern Fußball und höre Musik. Mein Hobby ist Gitarre spielen.",
          "english": "In my free time I like to play football and listen to music. My hobby is playing the guitar."
      },
      {
          "german": "Am Wochenende gehe ich oft wandern oder schwimmen. Ich lese auch gern ein Buch.",
          "english": "On the weekend I often go hiking or swimming. I also like to read a book."
      },
      {
          "german": "Ich sehe gern fern und spiele manchmal Computer. Am liebsten treibe ich Sport.",
          "english": "I like to watch television and sometimes play computer games. I like doing sports the most."
      },
      {
          "german": "Wir gehen oft ins Kino oder in die Disco. Das gefällt mir sehr.",
          "english": "We often go to the cinema or to the disco. I like that very much."
      },
      {
          "german": "Ich bin im Sportverein und wir spielen Karten. Das Museum ist auch sehr interessant.",
          "english": "I am in the sports club and we play cards. The museum is also very interesting."
      },
      {
          "german": "Das Schwimmbad ist heute geöffnet. Die Eintrittskarte kostet 5 Euro.",
          "english": "The swimming pool is open today. The entrance ticket costs 5 Euros."
      },
      {
          "german": "Mein Kopf tut weh und ich habe Fieber. Ich glaube, ich bin krank.",
          "english": "My head hurts and I have a fever. I think I am sick."
      },
      {
          "german": "Ich habe Schmerzen im Bauch. Ich muss zum Arzt gehen.",
          "english": "I have pain in my stomach. I have to go to the doctor."
      },
      {
          "german": "Meine Hände sind kalt. Ich brauche ein Medikament aus der Apotheke.",
          "english": "My hands are cold. I need a medicine from the pharmacy."
      },
      {
          "german": "Ich putze meine Zähne jeden Morgen und Abend. Mein Zahnarzt ist sehr nett.",
          "english": "I brush my teeth every morning and evening. My dentist is very nice."
      },
      {
          "german": "Ich schlafe acht Stunden pro Nacht. Das ist gut für meine Gesundheit.",
          "english": "I sleep eight hours per night. That's good for my health."
      },
      {
          "german": "Ich habe Hunger und Durst. Ich möchte etwas essen und trinken.",
          "english": "I am hungry and thirsty. I would like to eat and drink something."
      },
      {
          "german": "Zum Frühstück esse ich Brot mit Butter und Käse. Ich trinke Kaffee.",
          "english": "For breakfast I eat bread with butter and cheese. I drink coffee."
      },
      {
          "german": "Zum Mittagessen gibt es heute Fisch mit Kartoffeln und Gemüse. Zum Abendessen essen wir Salat.",
          "english": "For lunch we have fish with potatoes and vegetables today. For dinner we eat salad."
      },
      {
          "german": "Ich mag Obst wie Äpfel und Bananen. Manchmal esse ich auch Kuchen.",
          "english": "I like fruit like apples and bananas. Sometimes I also eat cake."
      },
      {
          "german": "Im Supermarkt kaufe ich Lebensmittel wie Milch und Eier. Das Kilo Tomaten ist günstig.",
          "english": "In the supermarket I buy groceries like milk and eggs. A kilo of tomatoes is cheap."
      },
      {
          "german": "Die Öffnungszeiten vom Geschäft sind von 8 bis 18 Uhr. Der Preis für das Brot ist 2 Euro.",
          "english": "The opening hours of the shop are from 8 am to 6 pm. The price for the bread is 2 Euros."
      },
      {
          "german": "Wir gehen ins Restaurant und bestellen eine Suppe und ein Hähnchen. Die Speisekarte ist lang.",
          "english": "We go to the restaurant and order a soup and a chicken. The menu is long."
      },
      {
          "german": "Ich möchte bitte die Rechnung bezahlen. Wir zahlen bar.",
          "english": "I would like to pay the bill, please. We are paying cash."
      },
      {
          "german": "Wo ist der Bahnhof? Gehen Sie geradeaus und dann links an der Ecke.",
          "english": "Where is the train station? Go straight ahead and then left at the corner."
      },
      {
          "german": "Ich fahre mit dem Auto zur Arbeit. Manchmal nehme ich aber auch den Bus.",
          "english": "I drive to work by car. But sometimes I also take the bus."
      },
      {
          "german": "Ich habe kein Fahrrad. Ich fahre lieber mit der Straßenbahn oder der U-Bahn.",
          "english": "I don't have a bicycle. I prefer to travel by tram or subway."
      },
      {
          "german": "Das Taxi hält hier. Wir müssen einsteigen.",
          "english": "The taxi is stopping here. We have to get in."
      },
      {
          "german": "Wir fliegen im Sommer nach Italien. Der Flug dauert zwei Stunden. Der Abflug ist um 10 Uhr.",
          "english": "We are flying to Italy in the summer. The flight takes two hours. The departure is at 10 o'clock."
      },
      {
          "german": "Unser Zug kommt um 15 Uhr am Bahnhof an. Wir müssen umsteigen.",
          "english": "Our train arrives at the station at 3 pm. We have to change trains."
      },
      {
          "german": "Ich möchte eine Fahrkarte nach München reservieren. Erste Klasse bitte.",
          "english": "I would like to reserve a ticket to Munich. First class, please."
      },
      {
          "german": "Wir machen Urlaub in den Bergen. Ich packe meinen Koffer und meine Reisetasche.",
          "english": "We are going on vacation in the mountains. I am packing my suitcase and my travel bag."
      },
      {
          "german": "Wir besuchen viele Sehenswürdigkeiten. Der Reiseführer gibt uns Informationen.",
          "english": "We visit many sights. The travel guide gives us information."
      },
      {
          "german": "Wir wohnen in einem Hotel. An der Rezeption müssen wir ein Formular ausfüllen und bezahlen.",
          "english": "We are staying in a hotel. At the reception we have to fill out a form and pay."
      },
      {
          "german": "Wir haben ein Doppelzimmer mit Halbpension. Der Schlüssel ist Nummer 205.",
          "english": "We have a double room with half board. The key is number 205."
      },
      {
          "german": "Ich wohne in einer kleinen Wohnung im ersten Stock. Meine Wohnung hat drei Zimmer.",
          "english": "I live in a small apartment on the first floor. My apartment has three rooms."
      },
      {
          "german": "Wir haben ein Haus mit einem großen Garten. Das Wohnzimmer ist sehr gemütlich.",
          "english": "We have a house with a big garden. The living room is very cozy."
      },
      {
          "german": "Das Schlafzimmer ist neben dem Badezimmer. Die Toilette ist separat.",
          "english": "The bedroom is next to the bathroom. The toilet is separate."
      },
      {
          "german": "Die Miete für meine Wohnung ist 500 Euro pro Monat. Mein Vermieter ist sehr nett.",
          "english": "The rent for my apartment is 500 Euros per month. My landlord is very nice."
      },
      {
          "german": "Wir möchten umziehen und suchen eine neue Wohnung. Die alte Wohnung ist zu klein.",
          "english": "We would like to move and are looking for a new apartment. The old apartment is too small."
      },
      {
          "german": "Die Tür ist offen, aber das Fenster ist zu. Die Wand ist gelb gestrichen.",
          "english": "The door is open, but the window is closed. The wall is painted yellow."
      },
      {
          "german": "Der Eingang ist auf der linken Seite. Der Ausgang ist hinten.",
          "english": "The entrance is on the left side. The exit is at the back."
      },
      {
          "german": "Wir haben einen kleinen Balkon. Im Garten stehen viele Blumen.",
          "english": "We have a small balcony. There are many flowers in the garden."
      },
      {
          "german": "Wir brauchen neue Möbel für das Wohnzimmer. Der Tisch und die Stühle sind alt.",
          "english": "We need new furniture for the living room. The table and chairs are old."
      },
      {
          "german": "Im Badezimmer haben wir eine Dusche und einen Spiegel. Ich brauche ein neues Handtuch.",
          "enlish": "In the bathroom we have a shower and a mirror. I need a new towel."
      },
      {
          "german": "An der Wand hängt ein Bild und eine Uhr. Ich muss das Licht anmachen.",
          "english": "There is a picture and a clock hanging on the wall. I have to turn on the light."
      },
      {
          "german": "Der Aufzug ist kaputt, wir müssen die Treppe nehmen.",
          "english": "The elevator is broken, we have to take the stairs."
      },
      {
          "german": "Ich muss einen Brief zur Post bringen. Ich brauche eine Briefmarke.",
          "english": "I have to take a letter to the post office. I need a stamp."
      },
      {
          "german": "Ich möchte eine Postkarte nach Hause schicken. Können Sie mir helfen?",
          "english": "I would like to send a postcard home. Can you help me?"
      },
      {
          "german": "Ich muss ein Paket abholen. Der Absender ist meine Mutter und ich bin der Empfänger.",
          "english": "I have to pick up a package. The sender is my mother and I am the recipient."
      },
      {
          "german": "Ich habe eine Telefonnummer, aber kein Telefonbuch. Ich versuche anzurufen.",
          "english": "I have a phone number, but no phone book. I will try to call."
      },
      {
          "german": "Niemand geht ans Telefon, es ist der Anrufbeantworter. Die Leitung ist besetzt.",
          "english": "Nobody answers the phone, it's the answering machine. The line is busy."
      },
      {
          "german": "Ich gehe zur Bank, um Geld abzuheben. Ich zahle lieber bar als mit Kreditkarte.",
          "english": "I am going to the bank to withdraw money. I prefer to pay cash rather than with a credit card."
      },
      {
          "german": "Ich habe ein Konto bei dieser Bank. Ich möchte Geld überweisen.",
          "english": "I have an account at this bank. I would like to transfer money."
      },
      {
          "german": "Bitte kreuzen Sie hier an und unterschreiben Sie das Formular. Der Geldautomat ist draußen.",
          "english": "Please tick here and sign the form. The ATM is outside."
      },
      {
          "german": "Ich brauche meinen Pass oder Ausweis. Ist dieser noch gültig?",
          "english": "I need my passport or ID card. Is this still valid?"
      },
      {
          "german": "Ich gehe zur Schule und bin in der 10. Klasse. Mein Lieblingsfach ist Deutsch.",
          "english": "I go to school and I am in the 10th grade. My favourite subject is German."
      },
      {
          "german": "Mein Lehrer ist sehr nett. Wir haben jeden Tag Unterricht und machen Pausen.",
          "english": "My teacher is very nice. We have lessons every day and take breaks."
      },
      {
          "german": "Ich muss meine Hausaufgaben machen. Wir haben nächste Woche eine Prüfung.",
          "english": "I have to do my homework. We have an exam next week."
      },
      {
          "german": "Ich habe die Lösung für die Aufgabe gefunden. Ich habe keinen Fehler gemacht.",
          "english": "I have found the solution for the task. I didn't make any mistakes."
      },
      {
          "german": "Ich arbeite in einem Büro. Mein Beruf ist Sekretärin.",
          "english": "I work in an office. My profession is secretary."
      },
      {
          "german": "Mein Arbeitsplatz ist in einer großen Firma. Mein Chef ist sehr streng.",
          "english": "My workplace is in a large company. My boss is very strict."
      },
      {
          "german": "Meine Kollegin ist sehr hilfsbereit. Ich bin nicht arbeitslos, ich habe einen Job.",
          "english": "My colleague (female) is very helpful. I am not unemployed, I have a job."
      },
      {
          "german": "Mein Bruder ist Arbeiter in einer Fabrik. Meine Schwester macht ein Praktikum.",
          "english": "My brother is a worker in a factory. My sister is doing an internship."
      },
      {
          "german": "Nach der Schule möchte ich eine Ausbildung machen.",
          "english": "After school I would like to do an apprenticeship."
      }
    ]
}