
[
    {
      "context": "Ihre Schwester Maria möchte Sie morgen besuchen. Schreiben Sie an Ihre Schwester:",
      "requirements": [
        "Sie können sie nicht vom Flughafen abholen.",
        "Wie kommt Maria zu Ihrer Wohnung?",
        "Maria soll warme Kleidung tragen."
      ]
    },
    {
      "context": "Sie möchten nächstes Jahr Deutsch in Berlin lernen und suchen einen Kurs. Schreiben Sie an die Sprachschule:",
      "requirements": [
        "Wann Deutsch lernen?",
        "Welchen Kurs?",
        "Preis?"
      ]
    },
    {
      "context": "Sie wollen am Wochenende mit einem Freund / einer Freundin einen Ausflug machen. Sie sind aber krank und können nicht. Schreiben Sie an Ihren Freund / Ihre Freundin:",
      "requirements": [
        "Warum schreiben Sie?",
        "Wie geht es Ihnen?",
        "Anderen Termin?"
      ]
    },
    {
      "context": "Ihr Chef, Herr Peter Mustermann, möchte seinem Sohn ein Geburtstagsgeschenk schenken. Aber er hat keine Ahnung was er verschenken soll. Sie möchten ihm helfen. Schreiben Sie an Herrn Peter Mustermann:",
      "requirements": [
        "Welches Geschenk?",
        "Preis?",
        "Wo kaufen?"
      ]
    },
    {
      "context": "Sie haben Ihre Freunde Maria und Tom lange nicht gesehen. Deshalb möchten Sie mit ihnen essen gehen. Schreiben Sie an Maria und Tom:",
      "requirements": [
        "Einladung",
        "Wo essen?",
        "Wann treffen?"
      ]
    },
    {
      "context": "Sie möchten mit Ihrem Freund Tom am Sonntag einen Ausflug mit dem Fahrrad machen. Schreiben Sie Tom eine E-Mail.",
      "requirements": [
        "Warum schreiben Sie?",
        "Wohin fahren?",
        "Wo wollen Sie sich treffen?"
      ]
    },
    {
      "context": "Sie wollen heute Abend mit einem Freund/ einer Freundin ins Kino gehen. Sie sind aber krank und können nicht. Schreiben Sie Ihrem Freund / Ihrer Freundin eine SMS.",
      "requirements": [
        "Warum schreiben Sie?",
        "Wie geht es Ihnen?",
        "Wann treffen?"
      ]
    },
    {
      "context": "Sie möchten im Sommer Deutsch in Deutschland lernen und suchen einen Kurs. Schreiben Sie an die Sprachschule.",
      "requirements": [
        "Warum schreiben Sie?",
        "Wann Deutsch lernen?",
        "Welcher Kurs?"
      ]
    },
    {
      "context": "Sie haben eine neue Wohnung und möchten das feiern. Schreiben Sie eine Einladung zu Ihrer Party.",
      "requirements": [
        "Warum schreiben Sie?",
        "Wann ist die Party?",
        "Was mitbringen?"
      ]
    }
  ]